/************************************************************
    Copyright (C), 2020, DT9025A
    文件名:  ds3231.h
    作者:    DT9025A
    版本:    R1.0
    日期:    20/7/8
    描述:    DS3231基础驱动
             依赖外部库: VIIC_C51
             本驱动在 STC12C4052AD@12.0MHz 平台试验通过
    修订历史:
    <作者>   <时间>   <版本>   <描述>
    DT9025A  19/8/15   A1.0    编写完成
    DT9025A  20/7/8    R1.0    完善文档注释
***********************************************************/
#ifndef __DS3231_H_
#define __DS3231_H_

#include "VIIC_C51.h"

#define DS3231_ADD         0xD0

/***********************************************************************
    数据类型名:     Time
    描述:           存放时间的自定义数据类型
    sizeof(struct): 7
/**********************************************************************/
typedef struct {
    unsigned char year;
    unsigned char month;
    unsigned char date;
    unsigned char dow;
    unsigned char hour;
    unsigned char minute;
    unsigned char second;
} Time;

/***********************************************************************
    函数名:    SetDS3231PPS
    描述:      设置DS3231的秒闪功能
    调用:      IRcvStr
               ISendStr
    参数:      [unsigned char] enable : 是否开启秒闪(非0开)
    返回值:    void
    其他说明:  无
/**********************************************************************/
void SetDS3231PPS(unsigned char enable);

/***********************************************************************
    函数名:    GetDS3231PPS
    描述:      读取DS3231的秒闪功能状态
    调用:      IRcvStr
    参数:      void
    返回值:    [bit] : 是否开启秒闪(非0开)
    其他说明:  无
/**********************************************************************/
bit GetDS3231PPS();

/***********************************************************************
    函数名:    GetDS3231
    描述:      读取DS3231的时间
    调用:      IRcvStr
    参数:      [Time*] time : 存放时间的结构体指针
    返回值:    void
    其他说明:  无
/**********************************************************************/
void GetDS3231(Time *time);

/***********************************************************************
    函数名:    SetDS3231
    描述:      设置DS3231的时间
    调用:      ISendStr
    参数:      [Time*] time : 存放时间的结构体指针
    返回值:    void
    其他说明:  无
/**********************************************************************/
void SetDS3231(Time *time);

#endif