/************************************************************
    Copyright (C), 2020, DT9025A
    文件名:  hpdl1414.h
    作者:    DT9025A
    版本:    A1.1
    日期:    20/7/8
    描述:    HPDL1414驱动 (数据线占一组端口)
             本驱动在 STC12C4052AD@12.0MHz 平台试验通过
    修订历史:
    <作者>   <时间>   <版本>   <描述>
    DT9025A  20/4/12   A1.0    编写完成
    DT9025A  20/7/8    A1.1    完善文档注释
***********************************************************/

#ifndef __HPDL_1414_H_
#define __HPDL_1414_H_

#include <STC12C2052AD.H>
#include <intrins.h>

// 模块个数，若有多个则需定义W_R_1等
#define MODELNUM 1

//片选
sbit W_R = P3 ^ 4;
//位选高位
sbit A1 = P3 ^ 0;
//位选低位
sbit A0 = P3 ^ 1;
//sbit W_R_1 = P3 ^ 2;
//数据输出端口
#define DATA_OUT P1


/***********************************************************************
    函数名:    dispChar
    描述:      显示一个字符
    调用:      Digital
               W
               CWR
    参数:      [char]            x : 要显示的字符
               [unsigned char] pos : 要显示的位置
               [unsigned char]   i : 要显示的HPDL1414编号
    返回值:    void
    其他说明:  无
/**********************************************************************/
void dispChar (char x, unsigned char pos, unsigned char i);

/***********************************************************************
    函数名:    dispString
    描述:      显示字符串
    调用:      dispChar
    参数:      [char*] str : 要显示的字符串
    返回值:    void
    其他说明:  支持多块并联，超出显示范围则折回开头继续显示
/**********************************************************************/
void dispString (char *str);

#endif