/************************************************************
    Copyright (C), 2020, DT9025A
    文件名:  adc.c
    作者:    DT9025A
    版本:    A 1.0
    日期:    20/7/8
    描述:    STC12系列的片上ADC驱动
    修订历史:
    <作者>   <时间>   <版本>   <描述>
    DT9025A  20/7/8   A1.0     完善文档注释
***********************************************************/

#include "adc.h"

/***********************************************************************
    函数名:    Init_ADC
    描述:      初始化片上ADC模块
    调用:      无
    参数:      void
    返回值:    void
    其他说明:  先进行初始化再读取
/**********************************************************************/
void Init_ADC() {
    //设置P1
    P1ASF = 1 << ADC_R_PIN;
    AUXR1 |= 1 << 2;         //1:ADC_RES<<8+ADC_RESL
    ADC_RES = 0;
    ADC_RESL = 0;
    ADC_CONTR = 0x80 | ADC_SPEED << 5;
    _nop_();
    _nop_();
    _nop_();
    _nop_();
    _nop_();
    _nop_();
    _nop_();
    _nop_();
}


/***********************************************************************
    函数名:    Read_ADC
    描述:      读取AD转换值
    调用:      无
    参数:      void
    返回值:    unsigned int : 转换结果
    其他说明:  无
/**********************************************************************/
unsigned int Read_ADC () {
    //开始转换
    ADC_CONTR |= 0x08;
    _nop_();
    _nop_();
    _nop_();
    _nop_();
    _nop_();
    _nop_();
    _nop_();
    _nop_();
    //等待转换完成
    while ((ADC_CONTR & 0x10) == 0);
    //清标志位
    ADC_CONTR &= 0xEF;
    return (ADC_RES << 8) | (ADC_RESL);
}
